Revit 2027 API
ParameterTypeId.ViewTemplate Property
 "View Template"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewTemplate { get; }
Public Shared ReadOnly Property ViewTemplate As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewTemplate {
	ForgeTypeId^ get ();
}
static member ViewTemplate : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace